[
    {
        "id": "1jf6147",
        "title": "\"My Bank\" just called me to inform me that one of my accounts was compromised.",
        "text": "Let me try this again. My previous title was junk :)\n\nJust posting this here for visibility/feedback, perhaps some people are more familiar with how this scam works? I can tell you that this guy would most likely have fooled my Parents (Both in their 70's) if he called them. The amount of data he had was convincing.\n\nSome Guy called me claiming to be \"my bank\", and my account had a security alert placed on it. He spoofed the Phone number of A Bank for the call (Which was Different from my bank that he was claiming to be from.) Weirdly, my phone rang twice. Once with the number showing '+1-800-735-8571', which I answered, and it instantly hung up, and then immediately thereafter with '+8007358571'. The second one is what it showed for the whole call\n\nWhat really surprised me was all the information he had. He had my Name, Address, Phone number, Email address, who I banked with, and the first SIX digits of my Credit Card number of the account that was 'supposedly compromised'. He told me all of this under 'verification'.. like \"Is your address still...\" \"Is your email address still...\" etc. I asked him for the last 4 digits, but he said he 'wasn't allowed' to provide those, lol.\n\nI pretty much knew it was a scam from the start, but I played along, not giving him anything, to try and find out everything he had (with the goal of figuring out where he got it from, and what he had so I could cancel/reset/etc that immediately thereafter).\n\nHe wanted me to change my password for my bank immediately, He was SUPER insistent on doing it right then Which got me worried that he somehow could see my screen or login or something, but I ran malware checkers and no sort of backdoor monitoring was found.\n\nRegardless, I told him that I had 2FA enabled on that login, and didn't see any attempts come through, so I wasn't going to reset it right now. I'm guessing after I changed it, he would have asked me for the new one or something.. I dunno. He abandoned that pretty quickly when I told him I'd do it later.\n\nEventually I told him 'Lets just cancel that card then, if its been compromised'. At that point he asked me for the last 4 of my SSN and my mother's maiden name, so I asked him for his extension number so I can call him back through my Bank's main number to provide secure information like that. He said some bullshit about needing to call him back on a personal line, to which I told him to go fuck himself, and hung up.\n\nFrom the data he had, It seems like some e-commerce site I shopped at somewhere, sometime, might have gotten compromised. He had everything that would have been on a typical 'Checkout' page for a website. Name, Email, Phone (He called me), Address, and some credit card information.\n\nI immediately called my (ACTUAL) bank, and cancelled the card he referred to, informed them of the scam attempt, and reset my passwords, which I already have 2FA on, but just to be sure.",
        "upvotes": 29,
        "url": "https://www.reddit.com/r/Scams/comments/1jf6147/my_bank_just_called_me_to_inform_me_that_one_of/",
        "subreddit": "scams",
        "created_utc": 1742413930.0
    },
    {
        "id": "1jfd7i3",
        "title": "[US] Almost Got Scammed Trying to Get My Locs Retwisted",
        "text": "\n\nSo I was looking for someone to retwist my locs and came across a stylist on Facebook who seemed legit. They had tons of photos, a bunch of “client reviews,” and their prices were decent. I reached out, and they responded quickly, asking about my hair and what I wanted. Everything seemed cool at first.\n\nThen they insisted I send a deposit before they could confirm my appointment. I asked if I could pay in cash on the day of the service, but they kept pushing for the deposit through Cash App or Zelle. That was a red flag for me. I decided to reverse-image search some of their photos, and surprise—some of them were stolen from real stylists on Instagram!\n\nI called them out, and they blocked me immediately. I just wanted to warn y’all—if a stylist is pushing for a deposit but has no real proof of their work or any solid reputation, be careful. Always do your research before sending money!\n\nHas anyone else run into these Facebook scam stylists?",
        "upvotes": 5,
        "url": "https://www.reddit.com/r/Scams/comments/1jfd7i3/us_almost_got_scammed_trying_to_get_my_locs/",
        "subreddit": "scams",
        "created_utc": 1742433028.0
    },
    {
        "id": "1jexm4z",
        "title": "Just helped someone avoid the hurt child/accident scam",
        "text": "Just got a call from my gf's dad asking if I knew where she was, they just got a call she was in an accident and arrested\n\nHe did call the number they gave but they didn't pick up, I guess, but he still tried to see what was up. Unfortunately she was sleeping and missed it, but as soon as he said she called crying I said \"That's a scam\" immediately and gave details about it that he was like yep, yep\n\nShe's fine, car is fine, just a dumb scam. But this place helped me identify it immediately \n\nGave the usual \"Never call numbers someone gives you,never give money or info to anyone who calls you\"\n\nAnd now I'm really going to make the common scam list to give to her parents and mine. ",
        "upvotes": 329,
        "url": "https://www.reddit.com/r/Scams/comments/1jexm4z/just_helped_someone_avoid_the_hurt_childaccident/",
        "subreddit": "scams",
        "created_utc": 1742392755.0
    },
    {
        "id": "1jfloo7",
        "title": "[DE] TikTok Cooperation Scam?",
        "text": "Hello everyone, \n\nI live in Germany and this is happening with a German “company”. \n\nI run several Faceless TikTok accounts to earn some extra money. I have now received a cooperation request on one of the accounts for the first time. It's about an app. I'm supposed to keep posting my content and then incorporate the app. For every video in which I promote the app, I receive the following remuneration, according to the contract: \n\n5,000 views: €10\n\n10,000 views: 20 €\n\n50,000 views: 50 €\n\n100,000 views: 150 €\n\n1,000,000 views: 300 €\n\nThe remuneration is not outstanding, but I get an average of 50-150k views, so it can be worth it. However, I'm a bit afraid of falling for a scam. \n\nThe app I'm talking about does exist. There is also a website for it and the UG mentioned in the legal notice is also entered in the commercial register. The managing director is also mentioned by name, but I couldn't really find out much. The UG has only been in existence since January 15, 2025. \n\nI was also sent the contract via Google Docs. The contract is not the kind of contract you would expect from an employer, but there are no suspicious-looking clauses or anything recognizable. \n\nSo far, I've only sent one of my trash mails (to send the contract). In order to finalize the contract, he now wants my personal data and also my Apple ID so that he can give me 100% premium access.\n\nPayment would be made via Paypal, I will issue invoices as soon as I want a payout (contractually regulated)\n\nDo you have any ideas on how I could be scammed here or what I should look out for? Is this a normal procedure for cooperations?\n\n",
        "upvotes": 1,
        "url": "https://www.reddit.com/r/Scams/comments/1jfloo7/de_tiktok_cooperation_scam/",
        "subreddit": "scams",
        "created_utc": 1742466067.0
    },
    {
        "id": "1jfi9rj",
        "title": "[US]Prime Video’s “Ad-Free” Subscription is a Total Scam – and the Biggest Irony Proves It",
        "text": "So, like many others, I begrudgingly paid the extra $2.99/month for Prime Video’s “ad-free” experience—only to still be hit with forced ads on certain content. Annoying, right? But okay, I get it—some third-party content (like Freevee or live TV) might be outside Amazon’s control.\n\nBut today, I experienced the ultimate slap in the face: I was forced to watch ads on a Prime Video Original—a movie labeled “Only supported with ads.” And the biggest irony? The movie was “Bezos: The Beginning”—a biopic of Amazon’s own founder!\n\nWhen I reached out to support, I was told that content owners can choose to force ads, and Amazon has no control over it. Excuse me?? If a movie has the Prime logo on it and I’m paying for an ad-free subscription, how is this acceptable?\n\nAmazon is literally selling an ad-free upgrade that isn’t actually ad-free. If that’s not a scam, I don’t know what is.",
        "upvotes": 30,
        "url": "https://www.reddit.com/gallery/1jfi9rj",
        "subreddit": "scams",
        "created_utc": 1742450430.0
    },
    {
        "id": "1jfhfjl",
        "title": "Phone call saying I'm being summoned to court,  United States, New Jersey",
        "text": "I got a phone call saying tomorrow I will get a summons in the mail for court and she gave me a number to call.\n I called the number and a woman says I'm being sued and ill get a summons in the mail tomorrow for court saying I owe a bill for a loan to wells fargo from 2011. I never took out a loan ever and why wait 14 years to take action.  \nI feel like it's scam! Has anyone else received a call like this that was bogus? \nAlso NJ has a statue of limitations of 6 years. ",
        "upvotes": 8,
        "url": "https://www.reddit.com/r/Scams/comments/1jfhfjl/phone_call_saying_im_being_summoned_to_court/",
        "subreddit": "scams",
        "created_utc": 1742446959.0
    },
    {
        "id": "1jf804q",
        "title": "[US] \"Free\" solar panels if we let them bury \"solar line\" - Rural Oklahoma",
        "text": "Hello everyone.   \n  \nThere was recently a white SUV that pulled in to our driveway. We **live out in the middle of nowhere** pretty much so this was a rare occurrence. My mom spoke to them, they said a whole bunch of stuff, and she ended up giving them her phone number.   \n  \nMy mom summarized it and said that they had to run \"solar wire\" or something like that across our property in order to get where they were going in a straight line. They said that they would **pay** ***us*** $3,000 something every year for 7 years if they got approved. They also said something along the lines of that we could get solar panels installed free of charge.\n\nIs this a scam? It sounds a bit too good to be true but then again they reason it out with them having to bury lines. I am kind of believing it as is because there is a power line (one of those big metal things) pretty close to our house. \n\nFrom sitting in the living room, I overheard something being said that he was out from McAlester or something. McAlester is a little less than an hour away from us.\n\nI'm not sure exactly what they (he? I think there was only one guy, i could only hear one voice) said, but if any of you need more information I'm sure I could ask my mom.\n\nThank you.",
        "upvotes": 44,
        "url": "https://www.reddit.com/r/Scams/comments/1jf804q/us_free_solar_panels_if_we_let_them_bury_solar/",
        "subreddit": "scams",
        "created_utc": 1742418832.0
    },
    {
        "id": "1jfize2",
        "title": "CC Pre-approved but below minimum Income",
        "text": "I recently called my bank for an unrelated matter, and at the end, the agent mentioned that I am pre-approved for a credit card upgrade, and he offered me to upgrade and I said yes, and I was instantly approved. He didn't mention any income requirement nor did he ask about my income. He said the new card will arrive by mail.\n\nAfter the call, I checked online on the bank's website, I saw that the new credit card has a listed minimum income requirement that is above what I currently make. The only thing I can think of that would make me look good by the bank is decent credit score and high spending in the past year.\n\nIs this normal? Should I call the bank and let them know my income? I'm just scared of accidentally committing credit card fraud..",
        "upvotes": 3,
        "url": "https://www.reddit.com/r/personalfinance/comments/1jfize2/cc_preapproved_but_below_minimum_income/",
        "subreddit": "personalfinance",
        "created_utc": 1742453604.0
    },
    {
        "id": "1jfl8mf",
        "title": "[CZ/US] Fake Tripadvisor rating hotels scam",
        "text": "Nedávno mě kontaktoval random účet na telegramu, který se vydával za jinou osobu, nabízeli mi plnění \"tasků\" - úkolů, samozřejmě jeden z nich byl dobít peníze a poslat na další random účet a pak přijdou zpět i zhodnocené. Buď jde o praní peněz nebo scam celkově, dávejte si na to pozor, red flag může být hlavně čeština na úrovni bota - překladače. Ve skupině jsou klasická česká jména, ale profilovky ani nicknames nesedí. Přikládám fotky konverzací s dvěma profily a fotku skupiny, vše fake vytvořené prostředí pro to, abyste se cítili \"dobře\" a poslali své peníze.\n\nNejvětší zajímavost byla, že mi opravdu nejdřív poslali 250kč na revolut - chvíli jsem tomu věřil. A tak byste mohli i vy, ale nejste detektivové, prosím, nenalétněte jim.",
        "upvotes": 0,
        "url": "https://www.reddit.com/r/Scams/comments/1jfl8mf/czus_fake_tripadvisor_rating_hotels_scam/",
        "subreddit": "scams",
        "created_utc": 1742464214.0
    },
    {
        "id": "1jfepv1",
        "title": "[CA] Mom thinks she is dating Jason Momoa.",
        "text": "My mom has been a victim of multiple romance scams for months, possibly close to a year, believing she’s in a relationship with \"Jason Momoa\" and that \"Elon Musk\" is going to send her money. No matter how much my family tries to convince her that it’s fake, she refuses to listen. I believe she was targeted through Instagram, where she follows many Jason Momoa fan accounts. Scammers likely messaged her there and convinced her to download Telegram, where she now talks to them regularly. She shares personal information, including details about me and other family members, as well as her ID and our home address. At one point, someone even sent her a fake check in the mail, which she tried to cash.\n\nHer belief in these scams has caused serious damage to our family. My parents’ relationship was already rocky due to past issues, my dad may have cheated on my mom. I'm not sure if he did but from messages I was able to read when snooping through my moms phone that's what I can see. (I know it's not right to snoop through peoples phones, especially parents but it's come down to this.). My mom is obviously hurt and not in a good place mentally and I think she is finding comfort in these scammers. She insists that she has met \"Jason Momoa\" in person but has no proof, saying he’s currently in a hospital in Toronto. When I showed her that the real Jason Momoa is publicly dating Adria and filming movies, she got defensive. She even played me a voice message from \"Jason\" that was clearly AI-generated,it was robotic, fast-paced, and obviously scripted but she refused to accept that it wasn’t real and got angry.\n\nShe has also canceled important family plans because of this. My older sister planned for her daughters to see our mom, but she refused to come unless she could bring \"Jason.\" My sister, knowing this was a lie, refused because the request was bizarre but also because our mom is still married to our dad and my nieces are all below the age of 7 so she was worried what message this would send them.\n\nMy sisters and I are considering staging an intervention, and I plan to report everything to the police. However, I need to gather more information from her phone first, which may take time.   \n  \nIs there everything else me and my sisters can do in this situation in legal terms? My entire family is suffering from this and especially me as I'm the youngest one (19f) of my sisters who is still living with both my parents so I'm the one who has to hear this all the time.",
        "upvotes": 12,
        "url": "https://www.reddit.com/r/Scams/comments/1jfepv1/ca_mom_thinks_she_is_dating_jason_momoa/",
        "subreddit": "scams",
        "created_utc": 1742437579.0
    },
    {
        "id": "1jfh5bq",
        "title": "[US] - Package Delivered, Addressee Unknown",
        "text": "We received what appears to be a legitimate package delivered via FedEx from a Home Depot in another state. The package is in a Home Depot box and is correctly addressed to our home address. The Home Depot return address checks out. \n\nHowever, the addressee is a first & last name that doesn't come up on Google or DuckDuckGo search engines. While the name seems plausible at first glance, it results in *no* hits when quoted, and only the most peripheral results when not quoted. \n\nI figure I'll go through the process of contacting Home Depot tomorrow and let them have their shipper pick it up as it's their package, but I keep trying to figure if this is a setup for kind of scam. Thoughts? ",
        "upvotes": 3,
        "url": "https://www.reddit.com/r/Scams/comments/1jfh5bq/us_package_delivered_addressee_unknown/",
        "subreddit": "scams",
        "created_utc": 1742445852.0
    },
    {
        "id": "1jeomlm",
        "title": "He said I'll loose everything.",
        "text": "Location: TEXAS:  After 20 years, I'm calling it quits. I have a 30+ minute recording of my husband verbally & emotionally abusing me and telling me to kill myself, so, yeah, it's high time I get outta here. My husband has told me before, that he can get the County DA on his side (they went to school together, my husband works for the county, & this whole damn town is ran by the \"good ol' boy\" system). The kids are all grown, all that's left to decide upon is our home & 5 acres. When I met him, he had already bought the property a year prior. In the 20 years we've been here, my name has since been added to the land deed & in 2021 we refinanced it together. The house, when I met him was a 1 room, 1 bath shack. We have since added on significantly. All of the improvements and land payments have been made through our joint banking account. Honestly, I've contributed more monetarily (& in every other freaking way), to our home. I was told during a casual conversation with an attorney, that the house and land is my homestead, & therefore I would be owed half. My husband also said he wants to make sure that I'm the one to file for divorce because that will lessen my chance at getting half of the house & land. I'm kinda getting scared here now.",
        "upvotes": 372,
        "url": "https://www.reddit.com/r/legaladvice/comments/1jeomlm/he_said_ill_loose_everything/",
        "subreddit": "legaladvice",
        "created_utc": 1742357085.0
    },
    {
        "id": "1jezf69",
        "title": "Dad stole 12.3k from me, am I able to get it back?",
        "text": "Location: Washington State (USA)\n\nAbout a year ago I opened 2 CD’s that were 6k each. I say I opened, but in reality my dad took the money from my accounts (he was an authorized user), faked my signature and opened it himself in my name. I don’t know HOW my bank allowed this to happen. When I found out I immediately got him removed from the CD’s as well as all my accounts. \nUnfortunately by then he had taken an additional 6k from my savings account, which I think is legal since he had access? \n\nI’ve had absolutely no connection to him financially for a year now. However, my CD just matured. I found out it was still connected to his account somehow, and it automatically transferred to him. I will NOT see this money again. To be clear, no he is not an authorized user, and my bank had assured me he had no access. They said the paperwork he had filled out said for it to be deposited to him, and had been signed by me. \n\nBut it wasn’t my signature? It was him faking my signature right in front of them! I was literally not even at the bank with him. I never signed anything in regards to the CD’s, besides confirming I wanted him removed from them. \n\nI’m waiting on a call from my bank, but what am I supposed to do if they say they can’t do anything??? Is this legal? I’m incredibly stressed out. This will be 12.3k total he’s stolen from me in the past 2 years if this is legally okay. I’m SUPER worried about my other CD now too. What should I do? Is there a way to make sure he can’t get access again? Should I get a lawyer? I’m really at a loss.",
        "upvotes": 127,
        "url": "https://www.reddit.com/r/legaladvice/comments/1jezf69/dad_stole_123k_from_me_am_i_able_to_get_it_back/",
        "subreddit": "legaladvice",
        "created_utc": 1742397528.0
    },
    {
        "id": "1jf0ykp",
        "title": "Ordered item on Ebay, received it from Amazon... with a gift. What's the angle?",
        "text": "Hello everyone, trying to understand what's the angle here.\nI ordered some coffee on Ebay a few days ago and today it showed up in an Amazon box with something else I did not order (12 boxes of hot pot noodles).\nAs you can see from the photo of order confirmation (weirdly from Amazon), the pot noodles were part of the order...\nOnce contacted the seller on Ebay, he/she said the other item was a \"gift\".\nWhat's the angle? I thought about drop shipping but the same coffee I ordered from Ebay was more expensive on Amazon and I don't see how that would make any sense...\nAre they using a stolen card to then order or Amazon or what?\n\nThanks!",
        "upvotes": 93,
        "url": "https://www.reddit.com/gallery/1jf0ykp",
        "subreddit": "scams",
        "created_utc": 1742401431.0
    },
    {
        "id": "1jfeiwd",
        "title": "Scammers Accusing Me of Theft, Doxxing My Family—Anyone Dealt With This Before?",
        "text": "Has anyone seen this type of scam attack?\n\nThrowaway account.\n\n2 days ago, I started receiving phone calls, a FaceTime call, and text messages claiming I stole a woman’s purse from a restaurant and that I’m on video. I ignored the FaceTime and text messages but I answered one call, thinking it might be my buddy who always changes his number and randomly calls without letting me know it’s him in advance.\n\nThe caller said the theft happened in Philadelphia which I don’t live anywhere near. Then they started making ransom threats, so I ignored and blocked the number.\n\nYesterday I kept getting calls throughout the day but I just put my phone on do not disturb and ignored them.\n\nThis morning, my sister sent me a picture of texts she received from the scammers. They made more threats, saying this was because I “stole” a purse. The message also listed her social security number.\n\nThen they sent me one last message that included my social security number and a video of a guy (who is clearly not me) stealing a purse in what looks like a restaurant. They also threatened that they would start applying for loans in my name and warned me to put credit freezes on my account. Five minutes later I started getting spam text messages from bogus emails that looked like fake promotional signups. Since this morning they’ve spammed me with 200+ text messages from bogus emails. I have an iPhone so I guess this allows emails to come in as texts.\n\nNow they’re threatening to reach out to my friends, former employers, and family members to harass them as well and the ransom will increase every day.\n\nHas anyone experienced something similar? What did you do? I’ve already frozen my credit. I’d prefer not to change my number since I’ve had it for 20 years, but I’m open to it if necessary.\n\nTL;DR: Getting hit with a massive phishing attack. Already froze credit. Any ideas to make it stop?",
        "upvotes": 7,
        "url": "https://www.reddit.com/r/Scams/comments/1jfeiwd/scammers_accusing_me_of_theft_doxxing_my/",
        "subreddit": "scams",
        "created_utc": 1742436969.0
    }
]